export interface IDay {
    name: string,
    id: number,
    link: string,
    weeks: string[],
}

export interface ISchedule {
    day: string,
    exercises: IDay[],
}
export interface IProgramm {
    programmId: number,
    startProgramm: number,
}

export const settings: IProgramm = {
    programmId: 1,
    startProgramm: 1695621600000 //'Mon Oct 25 2023 08:00:00',
}

export const config: ISchedule[] = [
    {
        day: 'monday',
        exercises: [
            {
                name: 'Присед с гантелей',
                id: 0,
                link: '',
                weeks: ['3*8', '2*8', '4*8', '3*8', '4*12', '2*8', '3*8', '4*12'],
            },
            {
                name: 'Тяга верхнего блока',
                id: 1,
                link: '',
                weeks: ['3*15', '2*10', '4*8', '3*12', '4*12', '2*12', '3*20', '4*12'],
            },
            {
                name: 'Гиперэкстензия',
                id: 2,
                link: '',
                weeks: ['3*15', '2*15', '4*15', '3*20', '4*20', '2*15', '3*20', '4*20'],
            },
            {
                name: 'Тяга блока к поясу',
                id: 3,
                link: '',
                weeks: ['3*8', '2*8', '4*12', '3*8', '4*12', '2*8', '3*12', '4*12'],
            },
            {
                name: 'Выпады стоя назад',
                id: 4,
                link: '',
                weeks: ['3*8', '2*8', '4*8', '3*12', '4*8', '2*8', '3*8', '4*8'],
            },
            {
                name: 'Отжимания',
                id: 5,
                link: '',
                weeks: ['3*8', '2*8', '4*8', '3*8', '4*12', '2*8', '3*8', '4*12'],
            },
            {
                name: 'Отведения сидя',
                id: 6,
                link: '',
                weeks: ['3*8', '2*8', '4*8', '3*8', '4*12', '2*8', '3*8', '4*12'],
            },
            {
                name: 'Пресс',
                id: 7,
                link: '',
                weeks: ['7', '7', '7', '7', '7', '7', '7', '7'],
            },
        ],
    },
    {
        day: 'wednesday',
        exercises: [
            {
                name: 'Румынская тяга',
                id: 0,
                link: '',
                weeks: ['3*8', '2*12', '4*12', '3*8', '4*8', '2*8', '3*12', '4*8'],
            },
            {
                name: 'Отжимания',
                id: 1,
                link: '',
                weeks: ['3*15', '2*15', '4*15', '3*20', '4*20', '2*15', '3*20', '4*20'],
            },
            {
                name: 'Болгарский сплит присет',
                id: 2,
                link: '',
                weeks: ['3*8', '2*8', '4*12', '3*15', '4*8', '2*8', '3*12', '4*8'],
            },
            {
                name: 'Разгибание с косичкой',
                id: 3,
                link: '',
                weeks: ['3*12', '2*8', '4*8', '3*15', '4*8', '2*15', '3*8', '4*15'],
            },
            {
                name: 'Мостик с резинкой',
                id: 4,
                link: '',
                weeks: ['3*8', '2*8', '4*15', '3*8', '4*15', '2*8', '3*8', '4*15'],
            },
            {
                name: 'Тяга блока к поясу',
                id: 5,
                link: '',
                weeks: ['3*8', '2*8', '3*8', '3*15', '3*8', '2*12', '3*8', '3*8'],
            },
            {
                name: 'Сгибание голени',
                id: 6,
                link: '',
                weeks: ['3*8', '2*8', '4*12', '3*15', '4*8', '2*8', '3*15', '4*8'],
            },
            {
                name: 'Пресс',
                id: 7,
                link: '',
                weeks: ['7', '7', '7', '7', '7', '7', '7', '7'],
            },
        ]
    },
    {
        day: 'friday',
        exercises: [
            {
                name: 'Присед с гантелей',
                id: 0,
                link: '',
                weeks: ['3*20', '2*12', '4*15', '3*20', '4*20', '2*8', '3*15', '3*8'],
            },
            {
                name: 'Жим 45',
                id: 1,
                link: '',
                weeks: ['3*8', '2*8', '4*12', '3*12', '4*8', '2*8', '3*12', '3*12'],
            },
            {
                name: 'Мостик с резинкой',
                id: 2,
                link: '',
                weeks: ['3*15', '2*10', '4*8', '3*15', '4*12', '2*12', '3*20', '3*8'],
            },
            {
                name: 'Боковые отведения',
                id: 3,
                link: '',
                weeks: ['3*12', '2*8', '4*8', '3*12', '4*8', '2*8', '3*15', '3*12'],
            },
            {
                name: 'Махи на ягодицы',
                id: 4,
                link: '',
                weeks: ['3*15', '2*12', '4*12', '3*12', '4*12', '2*12', '3*20', '3*8'],
            },
            {
                name: 'Отведения в бок в наклон',
                id: 5,
                link: '',
                weeks: ['3*15', '2*15', '4*15', '3*20', '4*20', '2*15', '3*20', '4*20'],
            },
            {
                name: 'Отведения сидя',
                id: 6,
                link: '',
                weeks: ['3*20', '2*12', '4*15', '3*20', '4*20', '2*8', '3*15', '3*8'],
            },
            {
                name: 'Пресс',
                id: 7,
                link: '',
                weeks: ['7', '7', '7', '7', '7', '7', '7', '7'],
            },
        ],
    },
]